pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                  File 'pic18_intermediate_classes.cpp'                    *
//                        Generated by version 2.4.5                         *
//                      june 25th, 2013, at 14h52'31"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_intermediate_classes.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_intermediate_classes.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//Class for element of '@pic_31__38__5F_intermediate_5F_instructionList' list*
//                                                                           *
//---------------------------------------------------------------------------*

class cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList : public cCollectionElement {
  public : GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element mObject ;

//--- Constructor
  public : cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & in_mInstruction
                                                                              COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cCollectionElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//---------------------------------------------------------------------------*

cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList::cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & in_mInstruction
                                                                                                                                      COMMA_LOCATION_ARGS) :
cCollectionElement (THERE),
mObject (in_mInstruction) {
}

//---------------------------------------------------------------------------*

bool cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList::isValid (void) const {
  return mObject.isValid () ;
}

//---------------------------------------------------------------------------*

cCollectionElement * cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList::copy (void) {
  cCollectionElement * result = NULL ;
  macroMyNew (result, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (mObject.mAttribute_mInstruction COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mInstruction" ":" ;
  mObject.mAttribute_mInstruction.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList::compare (const cCollectionElement * inOperand) const {
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * operand = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) inOperand ;
  macroValidSharedObject (operand, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
  return mObject.objectCompare (operand->mObject) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList::GALGAS_pic_31__38__5F_intermediate_5F_instructionList (void) :
AC_GALGAS_list () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList::GALGAS_pic_31__38__5F_intermediate_5F_instructionList (cSharedList * inSharedListPtr) :
AC_GALGAS_list (inSharedListPtr) {
  if (NULL == inSharedListPtr) {
    createNewEmptyList (HERE) ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::constructor_emptyList (LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result ;
  result.createNewEmptyList (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::constructor_listWithValue (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result ;
  if (inOperand0.isValid ()) {
    result.createNewEmptyList (THERE) ;
    capCollectionElement attributes ;
    GALGAS_pic_31__38__5F_intermediate_5F_instructionList::makeAttributesFromObjects (attributes, inOperand0 COMMA_THERE) ;
    result.addObject (attributes) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::makeAttributesFromObjects (capCollectionElement & outAttributes,
                                                                                       const GALGAS_pic_31__38__5F_intermediate_5F_instruction & in_mInstruction
                                                                                       COMMA_LOCATION_ARGS) {
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = NULL ;
  macroMyNew (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (in_mInstruction COMMA_THERE)) ;
  outAttributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
}

//---------------------------------------------------------------------------*

