pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::addAssign_operation (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0
                                                                                 COMMA_LOCATION_ARGS) {
  if (isValid () && inOperand0.isValid ()) {
    cCollectionElement * p = NULL ;
    macroMyNew (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (inOperand0 COMMA_THERE)) ;
    capCollectionElement attributes ;
    attributes.setPointer (p) ;
    macroDetachSharedObject (p) ;
    addObject (attributes) ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::modifier_prependValue (GALGAS_pic_31__38__5F_intermediate_5F_instruction inOperand0
                                                                                   COMMA_LOCATION_ARGS) {
  if (isValid () && inOperand0.isValid ()) {
    cCollectionElement * p = NULL ;
    macroMyNew (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList (inOperand0 COMMA_THERE)) ;
    capCollectionElement attributes ;
    attributes.setPointer (p) ;
    macroDetachSharedObject (p) ;
    prependAttributeArray (attributes) ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::modifier_popFirst (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outOperand0,
                                                                               C_Compiler * inCompiler
                                                                               COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  removeFirstObject (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    outOperand0 = p->mObject.mAttribute_mInstruction ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::modifier_popLast (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outOperand0,
                                                                              C_Compiler * inCompiler
                                                                              COMMA_LOCATION_ARGS) {
  capCollectionElement attributes ;
  removeLastObject (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    macroUniqueSharedObject (p) ;
    outOperand0 = p->mObject.mAttribute_mInstruction ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::method_first (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outOperand0,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes ;
  readFirst (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    outOperand0 = p->mObject.mAttribute_mInstruction ;
  }
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::method_last (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outOperand0,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes ;
  readLast (attributes, inCompiler COMMA_THERE) ;
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) attributes.ptr () ;
  if (NULL == p) {
    outOperand0.drop () ;
  }else{
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    outOperand0 = p->mObject.mAttribute_mInstruction ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::operator_concat (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList & inOperand
                                                                                                                              COMMA_UNUSED_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result ;
  if (isValid () && inOperand.isValid ()) {
    result = *this ;
    result.appendList (inOperand) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::reader_subListWithRange (const GALGAS_range & inRange,
                                                                                                                                      C_Compiler * inCompiler
                                                                                                                                      COMMA_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result = GALGAS_pic_31__38__5F_intermediate_5F_instructionList::constructor_emptyList (THERE) ;
  subListWithRange (result, inRange, inCompiler COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::reader_subListFromIndex (const GALGAS_uint & inIndex,
                                                                                                                                      C_Compiler * inCompiler
                                                                                                                                      COMMA_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result = GALGAS_pic_31__38__5F_intermediate_5F_instructionList::constructor_emptyList (THERE) ;
  subListFromIndex (result, inIndex, inCompiler COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::dotAssign_operation (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList inOperand
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  appendList (inOperand) ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList::modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction inOperand,
                                                                                             GALGAS_uint inIndex,
                                                                                             C_Compiler * inCompiler
                                                                                             COMMA_LOCATION_ARGS) {
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) objectPointerAtIndex (inIndex, inCompiler COMMA_THERE) ;
  if (NULL != p) {
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    macroUniqueSharedObject (p) ;
    p->mObject.mAttribute_mInstruction = inOperand ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction GALGAS_pic_31__38__5F_intermediate_5F_instructionList::reader_mInstructionAtIndex (const GALGAS_uint & inIndex,
                                                                                                                                     C_Compiler * inCompiler
                                                                                                                                     COMMA_LOCATION_ARGS) const {
  capCollectionElement attributes = readObjectAtIndex (inIndex, inCompiler COMMA_THERE) ;
  cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) attributes.ptr () ;
  GALGAS_pic_31__38__5F_intermediate_5F_instruction result ;
  if (NULL != p) {
    macroValidSharedObject (p, cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
    result = p->mObject.mAttribute_mInstruction ;
  }
  return result ;
}



//---------------------------------------------------------------------------*

cEnumerator_pic_31__38__5F_intermediate_5F_instructionList::cEnumerator_pic_31__38__5F_intermediate_5F_instructionList (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList & inEnumeratedObject,
                                                                                                                        const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element cEnumerator_pic_31__38__5F_intermediate_5F_instructionList::current (LOCATION_ARGS) const {
  const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
  return p->mObject ;
}


//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction cEnumerator_pic_31__38__5F_intermediate_5F_instructionList::current_mInstruction (LOCATION_ARGS) const {
  const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList * p = (const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cCollectionElement_pic_31__38__5F_intermediate_5F_instructionList) ;
  return p->mObject.mAttribute_mInstruction ;
}




//---------------------------------------------------------------------------*
//                                                                           *
//                 @pic18_intermediate_instructionList type                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instructionList ("pic18_intermediate_instructionList",
                                                                       NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instructionList::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instructionList ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instructionList::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instructionList (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList GALGAS_pic_31__38__5F_intermediate_5F_instructionList::extractObject (const GALGAS_object & inObject,
                                                                                                                            C_Compiler * inCompiler,
                                                                                                                            const GALGAS_location & inErrorLocation
                                                                                                                            COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instructionList * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instructionList *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instructionList", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode::GALGAS_condionalBranchMode (void) :
mEnum (kNotBuilt) {
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode GALGAS_condionalBranchMode::constructor_native (UNUSED_LOCATION_ARGS) {
  GALGAS_condionalBranchMode result ;
  result.mEnum = kEnum_native ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode GALGAS_condionalBranchMode::constructor_ipicNative (UNUSED_LOCATION_ARGS) {
  GALGAS_condionalBranchMode result ;
  result.mEnum = kEnum_ipicNative ;
  return result ;
}

//---------------------------------------------------------------------------*

