pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_condionalBranchMode GALGAS_condionalBranchMode::constructor_ipicBRA (UNUSED_LOCATION_ARGS) {
  GALGAS_condionalBranchMode result ;
  result.mEnum = kEnum_ipicBRA ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode GALGAS_condionalBranchMode::constructor_ipicGOTO (UNUSED_LOCATION_ARGS) {
  GALGAS_condionalBranchMode result ;
  result.mEnum = kEnum_ipicGOTO ;
  return result ;
}

//---------------------------------------------------------------------------*

static const char * gEnumNameArrayFor_condionalBranchMode [5] = {
  "(not built)",
  "native",
  "ipicNative",
  "ipicBRA",
  "ipicGOTO"
} ;

//---------------------------------------------------------------------------*

void GALGAS_condionalBranchMode::description (C_String & ioString,
                                              const PMSInt32 /* inIndentation */) const {
  ioString << "<enum @condionalBranchMode: " << gEnumNameArrayFor_condionalBranchMode [mEnum] << ">" ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_condionalBranchMode::objectCompare (const GALGAS_condionalBranchMode & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    if (mEnum < inOperand.mEnum) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mEnum > inOperand.mEnum) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = kOperandEqual ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                         @condionalBranchMode type                         *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_condionalBranchMode ("condionalBranchMode",
                                            NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_condionalBranchMode::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_condionalBranchMode ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_condionalBranchMode::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_condionalBranchMode (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode GALGAS_condionalBranchMode::extractObject (const GALGAS_object & inObject,
                                                                      C_Compiler * inCompiler,
                                                                      const GALGAS_location & inErrorLocation
                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_condionalBranchMode result ;
  const GALGAS_condionalBranchMode * p = (const GALGAS_condionalBranchMode *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_condionalBranchMode *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "condionalBranchMode", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*



typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction::GALGAS_pic_31__38__5F_intermediate_5F_instruction (void) :
AC_GALGAS_class () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction::GALGAS_pic_31__38__5F_intermediate_5F_instruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inSourcePtr) :
AC_GALGAS_class (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
}

//---------------------------------------------------------------------------*
//          Pointer class for @pic18_intermediate_instruction class          *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction::cPtr_pic_31__38__5F_intermediate_5F_instruction (LOCATION_ARGS) :
acPtr_class (THERE) {
}



//---------------------------------------------------------------------------*
//                                                                           *
//                   @pic18_intermediate_instruction type                    *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction ("pic18_intermediate_instruction",
                                                                   NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction GALGAS_pic_31__38__5F_intermediate_5F_instruction::extractObject (const GALGAS_object & inObject,
                                                                                                                    C_Compiler * inCompiler,
                                                                                                                    const GALGAS_location & inErrorLocation
                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_NULL::dynamicObjectCompare (const acPtr_class * /* inOperandPtr */) const {
  return kOperandEqual ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_NULL::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_NULL & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_NULL::GALGAS_pic_31__38__5F_intermediate_5F_NULL (void) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_NULL::GALGAS_pic_31__38__5F_intermediate_5F_NULL (const cPtr_pic_31__38__5F_intermediate_5F_NULL * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_NULL) ;
}

//---------------------------------------------------------------------------*

