pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_NULL GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_NULL result ;
  macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_NULL (THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//             Pointer class for @pic18_intermediate_NULL class              *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_NULL::cPtr_pic_31__38__5F_intermediate_5F_NULL (LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_instruction (THERE) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_NULL::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL ;
}

void cPtr_pic_31__38__5F_intermediate_5F_NULL::description (C_String & ioString,
                                                            const PMSInt32 /* inIndentation */) const {
  ioString << "[@pic18_intermediate_NULL]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                       @pic18_intermediate_NULL type                       *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL ("pic18_intermediate_NULL",
                                                            & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_NULL::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_NULL::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_NULL (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_NULL GALGAS_pic_31__38__5F_intermediate_5F_NULL::extractObject (const GALGAS_object & inObject,
                                                                                                      C_Compiler * inCompiler,
                                                                                                      const GALGAS_location & inErrorLocation
                                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_NULL result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_NULL * p = (const GALGAS_pic_31__38__5F_intermediate_5F_NULL *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_NULL *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_NULL", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*



typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (void) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction) ;
}

//---------------------------------------------------------------------------*

GALGAS_location GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::reader_mInstructionLocation (UNUSED_LOCATION_ARGS) const {
  GALGAS_location result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * p = (const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction) ;
    result = p->mAttribute_mInstructionLocation ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_location cPtr_pic_31__38__5F_intermediate_5F_actualInstruction::reader_mInstructionLocation (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mInstructionLocation ;
}

//---------------------------------------------------------------------------*
//       Pointer class for @pic18_intermediate_actualInstruction class       *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_actualInstruction::cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (const GALGAS_location & in_mInstructionLocation
                                                                                                              COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_instruction (THERE),
mAttribute_mInstructionLocation (in_mInstructionLocation) {
}



//---------------------------------------------------------------------------*
//                                                                           *
//                @pic18_intermediate_actualInstruction type                 *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction ("pic18_intermediate_actualInstruction",
                                                                         & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

