pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA::description (C_String & ioString,
                                                                          const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_FBA:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mBitOrientedOp.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mRegisterDescription.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mBitNumber.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                 @pic18_intermediate_instruction_FBA type                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA ("pic18_intermediate_instruction_FBA",
                                                                          & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA::extractObject (const GALGAS_object & inObject,
                                                                                                                                  C_Compiler * inCompiler,
                                                                                                                                  const GALGAS_location & inErrorLocation
                                                                                                                                  COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_FBA", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mInstruction_5F_FDA_5F_base_5F_code.objectCompare (p->mAttribute_mInstruction_5F_FDA_5F_base_5F_code) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mRegisterDescription.objectCompare (p->mAttribute_mRegisterDescription) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_m_5F_W_5F_isDestination.objectCompare (p->mAttribute_m_5F_W_5F_isDestination) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                    const GALGAS_instruction_5F_FDA_5F_base_5F_code & inAttribute_mInstruction_5F_FDA_5F_base_5F_code,
                                                                                                                                    const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inAttribute_mRegisterDescription,
                                                                                                                                    const GALGAS_bool & inAttribute_m_5F_W_5F_isDestination
                                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mInstruction_5F_FDA_5F_base_5F_code.isValid () && inAttribute_mRegisterDescription.isValid () && inAttribute_m_5F_W_5F_isDestination.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (inAttribute_mInstructionLocation, inAttribute_mInstruction_5F_FDA_5F_base_5F_code, inAttribute_mRegisterDescription, inAttribute_m_5F_W_5F_isDestination COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (p->mAttribute_mInstructionLocation, p->mAttribute_mInstruction_5F_FDA_5F_base_5F_code, p->mAttribute_mRegisterDescription, p->mAttribute_m_5F_W_5F_isDestination COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

