pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_instruction_5F_FDA_5F_base_5F_code GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_mInstruction_5F_FDA_5F_base_5F_code (UNUSED_LOCATION_ARGS) const {
  GALGAS_instruction_5F_FDA_5F_base_5F_code result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
    result = p->mAttribute_mInstruction_5F_FDA_5F_base_5F_code ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_instruction_5F_FDA_5F_base_5F_code cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_mInstruction_5F_FDA_5F_base_5F_code (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mInstruction_5F_FDA_5F_base_5F_code ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_registerExpression result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
    result = p->mAttribute_mRegisterDescription ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mRegisterDescription ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_m_5F_W_5F_isDestination (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
    result = p->mAttribute_m_5F_W_5F_isDestination ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::reader_m_5F_W_5F_isDestination (UNUSED_LOCATION_ARGS) const {
  return mAttribute_m_5F_W_5F_isDestination ;
}

//---------------------------------------------------------------------------*
//        Pointer class for @pic18_intermediate_instruction_FDA class        *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (const GALGAS_location & in_mInstructionLocation,
                                                                                                                const GALGAS_instruction_5F_FDA_5F_base_5F_code & in_mInstruction_5F_FDA_5F_base_5F_code,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & in_mRegisterDescription,
                                                                                                                const GALGAS_bool & in_m_5F_W_5F_isDestination
                                                                                                                COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mInstruction_5F_FDA_5F_base_5F_code (in_mInstruction_5F_FDA_5F_base_5F_code),
mAttribute_mRegisterDescription (in_mRegisterDescription),
mAttribute_m_5F_W_5F_isDestination (in_m_5F_W_5F_isDestination) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::description (C_String & ioString,
                                                                          const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_FDA:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mInstruction_5F_FDA_5F_base_5F_code.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mRegisterDescription.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_m_5F_W_5F_isDestination.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                 @pic18_intermediate_instruction_FDA type                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA ("pic18_intermediate_instruction_FDA",
                                                                          & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA ;
}

//---------------------------------------------------------------------------*

