pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH::extractObject (const GALGAS_object & inObject,
                                                                                                                                    C_Compiler * inCompiler,
                                                                                                                                    const GALGAS_location & inErrorLocation
                                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_PUSH", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET result ;
  if (inAttribute_mInstructionLocation.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET (inAttribute_mInstructionLocation COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET (p->mAttribute_mInstructionLocation COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*
//       Pointer class for @pic18_intermediate_instruction_RESET class       *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RESET (const GALGAS_location & in_mInstructionLocation
                                                                                                                    COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE) {
}

//---------------------------------------------------------------------------*

