pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE::extractObject (const GALGAS_object & inObject,
                                                                                                                                        C_Compiler * inCompiler,
                                                                                                                                        const GALGAS_location & inErrorLocation
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_RETFIE", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mLiteralValue.objectCompare (p->mAttribute_mLiteralValue) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                        const GALGAS_uint & inAttribute_mLiteralValue
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mLiteralValue.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW (inAttribute_mInstructionLocation, inAttribute_mLiteralValue COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW (p->mAttribute_mInstructionLocation, p->mAttribute_mLiteralValue COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::reader_mLiteralValue (UNUSED_LOCATION_ARGS) const {
  GALGAS_uint result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
    result = p->mAttribute_mLiteralValue ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

