pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN::extractObject (const GALGAS_object & inObject,
                                                                                                                                        C_Compiler * inCompiler,
                                                                                                                                        const GALGAS_location & inErrorLocation
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_RETURN", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation
                                                                                                                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE result ;
  if (inAttribute_mInstructionLocation.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (inAttribute_mInstructionLocation COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (p->mAttribute_mInstructionLocation COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*
//Pointer class for @pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE class*
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (const GALGAS_location & in_mInstructionLocation
                                                                                                                                                                  COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE ;
}

