pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_tableAccessOption GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::reader_mOption (UNUSED_LOCATION_ARGS) const {
  GALGAS_tableAccessOption result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD) ;
    result = p->mAttribute_mOption ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_tableAccessOption cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::reader_mOption (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mOption ;
}

//---------------------------------------------------------------------------*
//       Pointer class for @pic18_intermediate_instruction_TBLRD class       *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD (const GALGAS_location & in_mInstructionLocation,
                                                                                                                    const GALGAS_tableAccessOption & in_mOption
                                                                                                                    COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mOption (in_mOption) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::description (C_String & ioString,
                                                                            const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_TBLRD:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mOption.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                @pic18_intermediate_instruction_TBLRD type                 *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD ("pic18_intermediate_instruction_TBLRD",
                                                                            & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD::extractObject (const GALGAS_object & inObject,
                                                                                                                                      C_Compiler * inCompiler,
                                                                                                                                      const GALGAS_location & inErrorLocation
                                                                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_TBLRD", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mOption.objectCompare (p->mAttribute_mOption) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                        const GALGAS_tableAccessOption & inAttribute_mOption
                                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mOption.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (inAttribute_mInstructionLocation, inAttribute_mOption COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (p->mAttribute_mInstructionLocation, p->mAttribute_mOption COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_tableAccessOption GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::reader_mOption (UNUSED_LOCATION_ARGS) const {
  GALGAS_tableAccessOption result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
    result = p->mAttribute_mOption ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_tableAccessOption cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::reader_mOption (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mOption ;
}

//---------------------------------------------------------------------------*
//       Pointer class for @pic18_intermediate_instruction_TBLWT class       *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (const GALGAS_location & in_mInstructionLocation,
                                                                                                                    const GALGAS_tableAccessOption & in_mOption
                                                                                                                    COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mOption (in_mOption) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT::description (C_String & ioString,
                                                                            const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_TBLWT:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mOption.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                @pic18_intermediate_instruction_TBLWT type                 *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT ("pic18_intermediate_instruction_TBLWT",
                                                                            & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

