pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_lstringlist cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::reader_mTargetLabels (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabels ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
    result = p->mAttribute_mUsesRCALL ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesRCALL ;
}

//---------------------------------------------------------------------------*
//   Pointer class for @pic18_intermediate_instruction_computed_bra class    *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                        const GALGAS_lstringlist & in_mTargetLabels,
                                                                                                                                        const GALGAS_bool & in_mUsesRCALL
                                                                                                                                        COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mTargetLabels (in_mTargetLabels),
mAttribute_mUsesRCALL (in_mUsesRCALL) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::description (C_String & ioString,
                                                                                      const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_computed_bra:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabels.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesRCALL.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//             @pic18_intermediate_instruction_computed_bra type             *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra ("pic18_intermediate_instruction_computed_bra",
                                                                                      & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::extractObject (const GALGAS_object & inObject,
                                                                                                                                                          C_Compiler * inCompiler,
                                                                                                                                                          const GALGAS_location & inErrorLocation
                                                                                                                                                          COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_computed_bra", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mTargetLabels.objectCompare (p->mAttribute_mTargetLabels) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mUsesRCALL.objectCompare (p->mAttribute_mUsesRCALL) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                              const GALGAS_lstringlist & inAttribute_mTargetLabels,
                                                                                                                                                              const GALGAS_bool & inAttribute_mUsesRCALL
                                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mTargetLabels.isValid () && inAttribute_mUsesRCALL.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (inAttribute_mInstructionLocation, inAttribute_mTargetLabels, inAttribute_mUsesRCALL COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (p->mAttribute_mInstructionLocation, p->mAttribute_mTargetLabels, p->mAttribute_mUsesRCALL COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstringlist GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::reader_mTargetLabels (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstringlist result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
    result = p->mAttribute_mTargetLabels ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstringlist cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::reader_mTargetLabels (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabels ;
}

//---------------------------------------------------------------------------*

