pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
    result = p->mAttribute_mUsesRCALL ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesRCALL ;
}

//---------------------------------------------------------------------------*
//   Pointer class for @pic18_intermediate_instruction_computed_goto class   *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                          const GALGAS_lstringlist & in_mTargetLabels,
                                                                                                                                          const GALGAS_bool & in_mUsesRCALL
                                                                                                                                          COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mTargetLabels (in_mTargetLabels),
mAttribute_mUsesRCALL (in_mUsesRCALL) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::description (C_String & ioString,
                                                                                       const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_computed_goto:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabels.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesRCALL.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//            @pic18_intermediate_instruction_computed_goto type             *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto ("pic18_intermediate_instruction_computed_goto",
                                                                                       & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::extractObject (const GALGAS_object & inObject,
                                                                                                                                                            C_Compiler * inCompiler,
                                                                                                                                                            const GALGAS_location & inErrorLocation
                                                                                                                                                            COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_computed_goto", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mTargetLabels.objectCompare (p->mAttribute_mTargetLabels) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mEndOfInstructionLabel.objectCompare (p->mAttribute_mEndOfInstructionLabel) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mUsesRCALL.objectCompare (p->mAttribute_mUsesRCALL) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
}

//---------------------------------------------------------------------------*

