pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                                const GALGAS_lstringlist & inAttribute_mTargetLabels,
                                                                                                                                                                const GALGAS_string & inAttribute_mEndOfInstructionLabel,
                                                                                                                                                                const GALGAS_bool & inAttribute_mUsesRCALL
                                                                                                                                                                COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mTargetLabels.isValid () && inAttribute_mEndOfInstructionLabel.isValid () && inAttribute_mUsesRCALL.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (inAttribute_mInstructionLocation, inAttribute_mTargetLabels, inAttribute_mEndOfInstructionLabel, inAttribute_mUsesRCALL COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (p->mAttribute_mInstructionLocation, p->mAttribute_mTargetLabels, p->mAttribute_mEndOfInstructionLabel, p->mAttribute_mUsesRCALL COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstringlist GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mTargetLabels (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstringlist result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
    result = p->mAttribute_mTargetLabels ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstringlist cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mTargetLabels (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabels ;
}

//---------------------------------------------------------------------------*

GALGAS_string GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mEndOfInstructionLabel (UNUSED_LOCATION_ARGS) const {
  GALGAS_string result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
    result = p->mAttribute_mEndOfInstructionLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_string cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mEndOfInstructionLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mEndOfInstructionLabel ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
    result = p->mAttribute_mUsesRCALL ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesRCALL ;
}

//---------------------------------------------------------------------------*
//  Pointer class for @pic18_intermediate_instruction_computed_rcall class   *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                            const GALGAS_lstringlist & in_mTargetLabels,
                                                                                                                                            const GALGAS_string & in_mEndOfInstructionLabel,
                                                                                                                                            const GALGAS_bool & in_mUsesRCALL
                                                                                                                                            COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mTargetLabels (in_mTargetLabels),
mAttribute_mEndOfInstructionLabel (in_mEndOfInstructionLabel),
mAttribute_mUsesRCALL (in_mUsesRCALL) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::description (C_String & ioString,
                                                                                        const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_computed_rcall:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabels.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mEndOfInstructionLabel.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesRCALL.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//            @pic18_intermediate_instruction_computed_rcall type            *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall ("pic18_intermediate_instruction_computed_rcall",
                                                                                        & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::extractObject (const GALGAS_object & inObject,
                                                                                                                                                              C_Compiler * inCompiler,
                                                                                                                                                              const GALGAS_location & inErrorLocation
                                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_computed_rcall", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mLiteralValues.objectCompare (p->mAttribute_mLiteralValues) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mUsesRCALL.objectCompare (p->mAttribute_mUsesRCALL) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

