pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                                const GALGAS_uintlist & inAttribute_mLiteralValues,
                                                                                                                                                                const GALGAS_bool & inAttribute_mUsesRCALL
                                                                                                                                                                COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mLiteralValues.isValid () && inAttribute_mUsesRCALL.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (inAttribute_mInstructionLocation, inAttribute_mLiteralValues, inAttribute_mUsesRCALL COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (p->mAttribute_mInstructionLocation, p->mAttribute_mLiteralValues, p->mAttribute_mUsesRCALL COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_uintlist GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::reader_mLiteralValues (UNUSED_LOCATION_ARGS) const {
  GALGAS_uintlist result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
    result = p->mAttribute_mLiteralValues ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_uintlist cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::reader_mLiteralValues (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mLiteralValues ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
    result = p->mAttribute_mUsesRCALL ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesRCALL ;
}

//---------------------------------------------------------------------------*
//  Pointer class for @pic18_intermediate_instruction_computed_retlw class   *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                            const GALGAS_uintlist & in_mLiteralValues,
                                                                                                                                            const GALGAS_bool & in_mUsesRCALL
                                                                                                                                            COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mLiteralValues (in_mLiteralValues),
mAttribute_mUsesRCALL (in_mUsesRCALL) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::description (C_String & ioString,
                                                                                        const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_computed_retlw:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mLiteralValues.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesRCALL.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//            @pic18_intermediate_instruction_computed_retlw type            *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw ("pic18_intermediate_instruction_computed_retlw",
                                                                                        & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

