pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::extractObject (const GALGAS_object & inObject,
                                                                                                                                                              C_Compiler * inCompiler,
                                                                                                                                                              const GALGAS_location & inErrorLocation
                                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_computed_retlw", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mBranchMode.objectCompare (p->mAttribute_mBranchMode) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mConditionalBranch.objectCompare (p->mAttribute_mConditionalBranch) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mTargetLabel.objectCompare (p->mAttribute_mTargetLabel) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                                const GALGAS_condionalBranchMode & inAttribute_mBranchMode,
                                                                                                                                                                const GALGAS_conditional_5F_branch & inAttribute_mConditionalBranch,
                                                                                                                                                                const GALGAS_lstring & inAttribute_mTargetLabel
                                                                                                                                                                COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mBranchMode.isValid () && inAttribute_mConditionalBranch.isValid () && inAttribute_mTargetLabel.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (inAttribute_mInstructionLocation, inAttribute_mBranchMode, inAttribute_mConditionalBranch, inAttribute_mTargetLabel COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (p->mAttribute_mInstructionLocation, p->mAttribute_mBranchMode, p->mAttribute_mConditionalBranch, p->mAttribute_mTargetLabel COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mBranchMode (UNUSED_LOCATION_ARGS) const {
  GALGAS_condionalBranchMode result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
    result = p->mAttribute_mBranchMode ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_condionalBranchMode cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mBranchMode (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mBranchMode ;
}

//---------------------------------------------------------------------------*

GALGAS_conditional_5F_branch GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mConditionalBranch (UNUSED_LOCATION_ARGS) const {
  GALGAS_conditional_5F_branch result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
    result = p->mAttribute_mConditionalBranch ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

