pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_conditional_5F_branch cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mConditionalBranch (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mConditionalBranch ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstring result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
    result = p->mAttribute_mTargetLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabel ;
}

//---------------------------------------------------------------------------*
// Pointer class for @pic18_intermediate_instruction_conditionalBranch class *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                            const GALGAS_condionalBranchMode & in_mBranchMode,
                                                                                                                                            const GALGAS_conditional_5F_branch & in_mConditionalBranch,
                                                                                                                                            const GALGAS_lstring & in_mTargetLabel
                                                                                                                                            COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mBranchMode (in_mBranchMode),
mAttribute_mConditionalBranch (in_mConditionalBranch),
mAttribute_mTargetLabel (in_mTargetLabel) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::description (C_String & ioString,
                                                                                        const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_conditionalBranch:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mBranchMode.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mConditionalBranch.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabel.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//          @pic18_intermediate_instruction_conditionalBranch type           *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch ("pic18_intermediate_instruction_conditionalBranch",
                                                                                        & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::extractObject (const GALGAS_object & inObject,
                                                                                                                                                              C_Compiler * inCompiler,
                                                                                                                                                              const GALGAS_location & inErrorLocation
                                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_conditionalBranch", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

