pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mLiteralInstruction.objectCompare (p->mAttribute_mLiteralInstruction) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mLiteralValue.objectCompare (p->mAttribute_mLiteralValue) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                              const GALGAS_literal_5F_instruction_5F_opcode & inAttribute_mLiteralInstruction,
                                                                                                                                                              const GALGAS_uint & inAttribute_mLiteralValue
                                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mLiteralInstruction.isValid () && inAttribute_mLiteralValue.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (inAttribute_mInstructionLocation, inAttribute_mLiteralInstruction, inAttribute_mLiteralValue COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * p = (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
    cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (p->mAttribute_mInstructionLocation, p->mAttribute_mLiteralInstruction, p->mAttribute_mLiteralValue COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_literal_5F_instruction_5F_opcode GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::reader_mLiteralInstruction (UNUSED_LOCATION_ARGS) const {
  GALGAS_literal_5F_instruction_5F_opcode result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
    result = p->mAttribute_mLiteralInstruction ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_literal_5F_instruction_5F_opcode cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::reader_mLiteralInstruction (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mLiteralInstruction ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::reader_mLiteralValue (UNUSED_LOCATION_ARGS) const {
  GALGAS_uint result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * p = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
    result = p->mAttribute_mLiteralValue ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::reader_mLiteralValue (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mLiteralValue ;
}

//---------------------------------------------------------------------------*
// Pointer class for @pic18_intermediate_instruction_literalOperation class  *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                          const GALGAS_literal_5F_instruction_5F_opcode & in_mLiteralInstruction,
                                                                                                                                          const GALGAS_uint & in_mLiteralValue
                                                                                                                                          COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mLiteralInstruction (in_mLiteralInstruction),
mAttribute_mLiteralValue (in_mLiteralValue) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;
}

void cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::description (C_String & ioString,
                                                                                       const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_instruction_literalOperation:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mLiteralInstruction.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mLiteralValue.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//           @pic18_intermediate_instruction_literalOperation type           *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ("pic18_intermediate_instruction_literalOperation",
                                                                                       & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::extractObject (const GALGAS_object & inObject,
                                                                                                                                                            C_Compiler * inCompiler,
                                                                                                                                                            const GALGAS_location & inErrorLocation
                                                                                                                                                            COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instruction_literalOperation", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mRegisterDescription.objectCompare (p->mAttribute_mRegisterDescription) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mTargetLabel.objectCompare (p->mAttribute_mTargetLabel) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mBranchIfZero.objectCompare (p->mAttribute_mBranchIfZero) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mUsesBra.objectCompare (p->mAttribute_mUsesBra) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

