pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inAttribute_mRegisterDescription,
                                                                                                                                                const GALGAS_lstring & inAttribute_mTargetLabel,
                                                                                                                                                const GALGAS_bool & inAttribute_mBranchIfZero,
                                                                                                                                                const GALGAS_bool & inAttribute_mUsesBra
                                                                                                                                                COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mRegisterDescription.isValid () && inAttribute_mTargetLabel.isValid () && inAttribute_mBranchIfZero.isValid () && inAttribute_mUsesBra.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (inAttribute_mInstructionLocation, inAttribute_mRegisterDescription, inAttribute_mTargetLabel, inAttribute_mBranchIfZero, inAttribute_mUsesBra COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (p->mAttribute_mInstructionLocation, p->mAttribute_mRegisterDescription, p->mAttribute_mTargetLabel, p->mAttribute_mBranchIfZero, p->mAttribute_mUsesBra COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_registerExpression result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    result = p->mAttribute_mRegisterDescription ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mRegisterDescription ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstring result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    result = p->mAttribute_mTargetLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabel ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mBranchIfZero (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    result = p->mAttribute_mBranchIfZero ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mBranchIfZero (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mBranchIfZero ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mUsesBra (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    result = p->mAttribute_mUsesBra ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

