pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::reader_mUsesBra (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesBra ;
}

//---------------------------------------------------------------------------*
//      Pointer class for @pic18_intermediate_jump_test_register class       *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (const GALGAS_location & in_mInstructionLocation,
                                                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & in_mRegisterDescription,
                                                                                                                            const GALGAS_lstring & in_mTargetLabel,
                                                                                                                            const GALGAS_bool & in_mBranchIfZero,
                                                                                                                            const GALGAS_bool & in_mUsesBra
                                                                                                                            COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mRegisterDescription (in_mRegisterDescription),
mAttribute_mTargetLabel (in_mTargetLabel),
mAttribute_mBranchIfZero (in_mBranchIfZero),
mAttribute_mUsesBra (in_mUsesBra) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ;
}

void cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::description (C_String & ioString,
                                                                                const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_jump_test_register:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mRegisterDescription.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabel.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mBranchIfZero.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesBra.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                @pic18_intermediate_jump_test_register type                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ("pic18_intermediate_jump_test_register",
                                                                                & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::extractObject (const GALGAS_object & inObject,
                                                                                                                                              C_Compiler * inCompiler,
                                                                                                                                              const GALGAS_location & inErrorLocation
                                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * p = (const GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_jump_test_register", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  if (kOperandEqual == result) {
    result = mAttribute_mInstructionLocation.objectCompare (p->mAttribute_mInstructionLocation) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mRegisterDescription.objectCompare (p->mAttribute_mRegisterDescription) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mTargetLabel.objectCompare (p->mAttribute_mTargetLabel) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mComparison.objectCompare (p->mAttribute_mComparison) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mUsesBra.objectCompare (p->mAttribute_mUsesBra) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


