pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition (void) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::constructor_new (const GALGAS_location & inAttribute_mInstructionLocation,
                                                                                                                                                      const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inAttribute_mRegisterDescription,
                                                                                                                                                      const GALGAS_lstring & inAttribute_mTargetLabel,
                                                                                                                                                      const GALGAS_registerComparison & inAttribute_mComparison,
                                                                                                                                                      const GALGAS_bool & inAttribute_mUsesBra
                                                                                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition result ;
  if (inAttribute_mInstructionLocation.isValid () && inAttribute_mRegisterDescription.isValid () && inAttribute_mTargetLabel.isValid () && inAttribute_mComparison.isValid () && inAttribute_mUsesBra.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition (inAttribute_mInstructionLocation, inAttribute_mRegisterDescription, inAttribute_mTargetLabel, inAttribute_mComparison, inAttribute_mUsesBra COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition (p->mAttribute_mInstructionLocation, p->mAttribute_mRegisterDescription, p->mAttribute_mTargetLabel, p->mAttribute_mComparison, p->mAttribute_mUsesBra COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_registerExpression result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    result = p->mAttribute_mRegisterDescription ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mRegisterDescription ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstring result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    result = p->mAttribute_mTargetLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mTargetLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTargetLabel ;
}

//---------------------------------------------------------------------------*

GALGAS_registerComparison GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mComparison (UNUSED_LOCATION_ARGS) const {
  GALGAS_registerComparison result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    result = p->mAttribute_mComparison ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_registerComparison cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mComparison (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mComparison ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mUsesBra (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    result = p->mAttribute_mUsesBra ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::reader_mUsesBra (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mUsesBra ;
}

//---------------------------------------------------------------------------*
//  Pointer class for @pic18_intermediate_registerComparisonCondition class  *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition (const GALGAS_location & in_mInstructionLocation,
                                                                                                                                  const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & in_mRegisterDescription,
                                                                                                                                  const GALGAS_lstring & in_mTargetLabel,
                                                                                                                                  const GALGAS_registerComparison & in_mComparison,
                                                                                                                                  const GALGAS_bool & in_mUsesBra
                                                                                                                                  COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_actualInstruction (in_mInstructionLocation COMMA_THERE),
mAttribute_mRegisterDescription (in_mRegisterDescription),
mAttribute_mTargetLabel (in_mTargetLabel),
mAttribute_mComparison (in_mComparison),
mAttribute_mUsesBra (in_mUsesBra) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition ;
}

void cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition::description (C_String & ioString,
                                                                                   const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_registerComparisonCondition:" ;
  mAttribute_mInstructionLocation.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mRegisterDescription.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mTargetLabel.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mComparison.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mUsesBra.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//           @pic18_intermediate_registerComparisonCondition type            *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition ("pic18_intermediate_registerComparisonCondition",
                                                                                   & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::extractObject (const GALGAS_object & inObject,
                                                                                                                                                    C_Compiler * inCompiler,
                                                                                                                                                    const GALGAS_location & inErrorLocation
                                                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition * p = (const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_registerComparisonCondition", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * p = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  if (kOperandEqual == result) {
    result = mAttribute_mLabel.objectCompare (p->mAttribute_mLabel) ;
  }
  if (kOperandEqual == result) {
    result = mAttribute_mIsDeletable.objectCompare (p->mAttribute_mIsDeletable) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (void) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
}

//---------------------------------------------------------------------------*

