pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::constructor_new (const GALGAS_lstring & inAttribute_mLabel,
                                                                                                                              const GALGAS_bool & inAttribute_mIsDeletable
                                                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL result ;
  if (inAttribute_mLabel.isValid () && inAttribute_mIsDeletable.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (inAttribute_mLabel, inAttribute_mIsDeletable COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * p = (cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
    cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (p->mAttribute_mLabel, p->mAttribute_mIsDeletable COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::reader_mLabel (UNUSED_LOCATION_ARGS) const {
  GALGAS_lstring result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * p = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
    result = p->mAttribute_mLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::reader_mLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mLabel ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::reader_mIsDeletable (UNUSED_LOCATION_ARGS) const {
  GALGAS_bool result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * p = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
    result = p->mAttribute_mIsDeletable ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_bool cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::reader_mIsDeletable (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mIsDeletable ;
}

//---------------------------------------------------------------------------*
//         Pointer class for @pic18_intermediate_pseudo_LABEL class          *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (const GALGAS_lstring & in_mLabel,
                                                                                                          const GALGAS_bool & in_mIsDeletable
                                                                                                          COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_instruction (THERE),
mAttribute_mLabel (in_mLabel),
mAttribute_mIsDeletable (in_mIsDeletable) {
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ;
}

void cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::description (C_String & ioString,
                                                                       const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_pseudo_LABEL:" ;
  mAttribute_mLabel.description (ioString, inIndentation+1) ;
  ioString << ", " ;
  mAttribute_mIsDeletable.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                   @pic18_intermediate_pseudo_LABEL type                   *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ("pic18_intermediate_pseudo_LABEL",
                                                                       & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

