pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL::extractObject (const GALGAS_object & inObject,
                                                                                                                            C_Compiler * inCompiler,
                                                                                                                            const GALGAS_location & inErrorLocation
                                                                                                                            COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * p = (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_pseudo_LABEL", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * p = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  if (kOperandEqual == result) {
    result = mAttribute_mOrigin.objectCompare (p->mAttribute_mOrigin) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (void) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::constructor_new (const GALGAS_uint & inAttribute_mOrigin
                                                                                                                          COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG result ;
  if (inAttribute_mOrigin.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (inAttribute_mOrigin COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * p = (cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
    cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (p->mAttribute_mOrigin COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::reader_mOrigin (UNUSED_LOCATION_ARGS) const {
  GALGAS_uint result ;
  if (NULL != mObjectPtr) {
    const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * p = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) mObjectPtr ;
    macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
    result = p->mAttribute_mOrigin ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::reader_mOrigin (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mOrigin ;
}

//---------------------------------------------------------------------------*
//          Pointer class for @pic18_intermediate_pseudo_ORG class           *
//---------------------------------------------------------------------------*

cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (const GALGAS_uint & in_mOrigin
                                                                                                      COMMA_LOCATION_ARGS) :
cPtr_pic_31__38__5F_intermediate_5F_instruction (THERE),
mAttribute_mOrigin (in_mOrigin) {
}

//---------------------------------------------------------------------------*

