pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
const C_galgas_type_descriptor * cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::classDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ;
}

void cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::description (C_String & ioString,
                                                                     const PMSInt32 inIndentation) const {
  ioString << "[@pic18_intermediate_pseudo_ORG:" ;
  mAttribute_mOrigin.description (ioString, inIndentation+1) ;
  ioString << "]" ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                    @pic18_intermediate_pseudo_ORG type                    *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ("pic18_intermediate_pseudo_ORG",
                                                                     & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG::extractObject (const GALGAS_object & inObject,
                                                                                                                        C_Compiler * inCompiler,
                                                                                                                        const GALGAS_location & inErrorLocation
                                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * p = (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_pseudo_ORG", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//   Object comparison                                                       *
//---------------------------------------------------------------------------*

typeComparisonResult cPtr_pic_31__38__5F_intermediate_5F_word::dynamicObjectCompare (const acPtr_class * inOperandPtr) const {
  typeComparisonResult result = kOperandEqual ;
  const cPtr_pic_31__38__5F_intermediate_5F_word * p = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inOperandPtr ;
  macroValidSharedObject (p, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  if (kOperandEqual == result) {
    result = mAttribute_mValue.objectCompare (p->mAttribute_mValue) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*


typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_word::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_word & inOperand) const {
  typeComparisonResult result = kOperandNotValid ;
  if (isValid () && inOperand.isValid ()) {
    const PMSInt32 mySlot = mObjectPtr->classDescriptor ()->mSlotID ;
    const PMSInt32 operandSlot = inOperand.mObjectPtr->classDescriptor ()->mSlotID ;
    if (mySlot < operandSlot) {
      result = kFirstOperandLowerThanSecond ;
    }else if (mySlot > operandSlot) {
      result = kFirstOperandGreaterThanSecond ;
    }else{
      result = mObjectPtr->dynamicObjectCompare (inOperand.mObjectPtr) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_word::GALGAS_pic_31__38__5F_intermediate_5F_word (void) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_word::GALGAS_pic_31__38__5F_intermediate_5F_word (const cPtr_pic_31__38__5F_intermediate_5F_word * inSourcePtr) :
GALGAS_pic_31__38__5F_intermediate_5F_instruction (inSourcePtr) {
  macroNullOrValidSharedObject (inSourcePtr, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_word GALGAS_pic_31__38__5F_intermediate_5F_word::constructor_new (const GALGAS_uint & inAttribute_mValue
                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_word result ;
  if (inAttribute_mValue.isValid ()) {
    macroMyNew (result.mObjectPtr, cPtr_pic_31__38__5F_intermediate_5F_word (inAttribute_mValue COMMA_THERE)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_word::insulate (LOCATION_ARGS) {
  macroMutexLock (gInsulationMutex) ;
  if (isValid () && (mObjectPtr->retainCount () > 1)) {
    cPtr_pic_31__38__5F_intermediate_5F_word * p = (cPtr_pic_31__38__5F_intermediate_5F_word *) mObjectPtr ;
    macroValidSharedObject (p, cPtr_pic_31__38__5F_intermediate_5F_word) ;
    cPtr_pic_31__38__5F_intermediate_5F_word * r = NULL ;
    macroMyNew (r, cPtr_pic_31__38__5F_intermediate_5F_word (p->mAttribute_mValue COMMA_THERE)) ;
    macroAssignSharedObject (mObjectPtr, r) ;
    macroDetachSharedObject (r) ;
  }
  macroMutexUnlock (gInsulationMutex) ;
}

//---------------------------------------------------------------------------*

