pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_mAssemblyString.objectCompare (inOperand.mAttribute_mAssemblyString) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mRegisterAddress.objectCompare (inOperand.mAttribute_mRegisterAddress) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mNeedsBSR.objectCompare (inOperand.mAttribute_mNeedsBSR) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::isValid (void) const {
  return mAttribute_mAssemblyString.isValid () && mAttribute_mRegisterAddress.isValid () && mAttribute_mNeedsBSR.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::drop (void) {
  mAttribute_mAssemblyString.drop () ;
  mAttribute_mRegisterAddress.drop () ;
  mAttribute_mNeedsBSR.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::description (C_String & ioString,
                                                                            const PMSInt32 inIndentation) const {
  ioString << "<struct @pic18_intermediate_registerExpression:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_mAssemblyString.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mRegisterAddress.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mNeedsBSR.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_string GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::reader_mAssemblyString (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mAssemblyString ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::reader_mRegisterAddress (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mRegisterAddress ;
}

//---------------------------------------------------------------------------*

GALGAS_bool GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::reader_mNeedsBSR (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mNeedsBSR ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                @pic18_intermediate_registerExpression type                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerExpression ("pic18_intermediate_registerExpression",
                                                                          NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerExpression ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_registerExpression (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_registerExpression GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::extractObject (const GALGAS_object & inObject,
                                                                                                                                  C_Compiler * inCompiler,
                                                                                                                                  const GALGAS_location & inErrorLocation
                                                                                                                                  COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_registerExpression result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression * p = (const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_registerExpression", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//            Category method '@registerExpression resolveAccess'            *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_registerExpression_resolveAccess> gCategoryMethodTable_registerExpression_resolveAccess ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_resolveAccess (const PMSInt32 inClassIndex,
                                        categoryMethodSignature_registerExpression_resolveAccess inMethod) {
  gCategoryMethodTable_registerExpression_resolveAccess.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

