pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
void callCategoryMethod_resolveAccess (const cPtr_registerExpression * inObject,
                                       const GALGAS_uint constin_inAccessBankSplitOffset,
                                       const GALGAS_uint constin_inCurrentBank,
                                       const GALGAS_registerTable constin_inRegisterTable,
                                       GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & out_outIPICregisterDescription,
                                       GALGAS_bitSliceTable & out_outBitSliceTable,
                                       C_Compiler * inCompiler
                                       COMMA_LOCATION_ARGS) {
  out_outIPICregisterDescription.drop () ;
  out_outBitSliceTable.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_registerExpression) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_registerExpression_resolveAccess f = NULL ;
    if (classIndex < gCategoryMethodTable_registerExpression_resolveAccess.count ()) {
      f = gCategoryMethodTable_registerExpression_resolveAccess (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_registerExpression_resolveAccess.count ()) {
           f = gCategoryMethodTable_registerExpression_resolveAccess (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_registerExpression_resolveAccess.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inAccessBankSplitOffset, constin_inCurrentBank, constin_inRegisterTable, out_outIPICregisterDescription, out_outBitSliceTable, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_registerExpression_resolveAccess (const cPtr_registerExpression * inObject,
                                                             const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                             const GALGAS_uint constinArgument_inCurrentBank,
                                                             const GALGAS_registerTable constinArgument_inRegisterTable,
                                                             GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & outArgument_outIPICregisterDescription,
                                                             GALGAS_bitSliceTable & outArgument_outBitSliceTable,
                                                             C_Compiler * inCompiler
                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerExpression * object = inObject ;
  macroValidSharedObject (object, const cPtr_registerExpression) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_assemblyString = object->mAttribute_mRegisterName.reader_string (SOURCE_FILE_AT_LINE (30)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (31)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    var_assemblyString.dotAssign_operation (GALGAS_string (" + ").operator_concat (object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (32)).reader_hexString (SOURCE_FILE_AT_LINE (32)) COMMA_SOURCE_FILE_AT_LINE (32)) COMMA_SOURCE_FILE_AT_LINE (32)) ;
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uintlist var_registerAddressList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_size ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_registerAddress = GALGAS_uint ((PMUInt32) 0U) ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_string joker_1252_0 ; // Joker input parameter
  constinArgument_inRegisterTable.method_searchKey (object->mAttribute_mRegisterName, var_registerAddressList, var_size, outArgument_outBitSliceTable, joker_1252_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (38)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (40)).objectCompare (var_size)).boolEnum () ;
  if (kBoolTrue == test_1) {
    //-------- @errorInstructionForGeneration
    GALGAS_location location_2 (object->mAttribute_mOffset.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_2, GALGAS_string ("this offset is too large: should be lower than ").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (41)) COMMA_SOURCE_FILE_AT_LINE (41)) COMMA_SOURCE_FILE_AT_LINE (41)) ;
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_found = GALGAS_bool (false) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_uintlist enumerator_1456 (var_registerAddressList, kEnumeration_up) ;
  //--- complex foreach instruction
  bool bool_3 = var_found.operator_not (SOURCE_FILE_AT_LINE (45)).isValidAndTrue () ;
  if (enumerator_1456.hasCurrentObject () && bool_3) {
    while (enumerator_1456.hasCurrentObject () && bool_3) {
      //-------- @assignmentInstructionForGeneration
      var_found = GALGAS_bool (kIsStrictInf, enumerator_1456.current_mValue (HERE).objectCompare (constinArgument_inAccessBankSplitOffset)).operator_or (GALGAS_bool (kIsSupOrEqual, enumerator_1456.current_mValue (HERE).objectCompare (GALGAS_uint ((PMUInt32) 3840U).add_operation (constinArgument_inAccessBankSplitOffset, inCompiler COMMA_SOURCE_FILE_AT_LINE (46)))) COMMA_SOURCE_FILE_AT_LINE (46)) ;
      //-------- @assignmentInstructionForGeneration
      var_registerAddress = enumerator_1456.current_mValue (HERE) ;
      enumerator_1456.gotoNextObject () ;
      if (enumerator_1456.hasCurrentObject ()) {
        bool_3 = var_found.operator_not (SOURCE_FILE_AT_LINE (45)).isValidAndTrue () ;
      }
    }
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_needsBSRaccess = GALGAS_bool (false) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_4 = var_found.operator_not (SOURCE_FILE_AT_LINE (50)).boolEnum () ;
  if (kBoolTrue == test_4) {
    //-------- @assignmentInstructionForGeneration
    var_needsBSRaccess = GALGAS_bool (true) ;
    //-------- @methodCallInstructionForGeneration
    var_registerAddressList.method_first (var_registerAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (52)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_uint var_neededBank = var_registerAddress.right_shift_operation (GALGAS_uint ((PMUInt32) 8U) COMMA_SOURCE_FILE_AT_LINE (53)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_5 = GALGAS_bool (kIsNotEqual, var_neededBank.objectCompare (constinArgument_inCurrentBank)).boolEnum () ;
    if (kBoolTrue == test_5) {
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_string var_errorMessage = GALGAS_string ("Accessing the '").operator_concat (object->mAttribute_mRegisterName.reader_string (SOURCE_FILE_AT_LINE (55)) COMMA_SOURCE_FILE_AT_LINE (55)).operator_concat (GALGAS_string ("' needs the bank selection set to ") COMMA_SOURCE_FILE_AT_LINE (55)).operator_concat (var_neededBank.reader_string (SOURCE_FILE_AT_LINE (55)) COMMA_SOURCE_FILE_AT_LINE (55)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_6 = GALGAS_bool (kIsEqual, constinArgument_inCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (56)))).boolEnum () ;
      if (kBoolTrue == test_6) {
        //-------- @concatInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string (", but current bank selection cannot be known") COMMA_SOURCE_FILE_AT_LINE (57)) ;
      }else if (kBoolFalse == test_6) {
        //-------- @concatInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string (", but current bank selection is set to ").operator_concat (constinArgument_inCurrentBank.reader_string (SOURCE_FILE_AT_LINE (59)) COMMA_SOURCE_FILE_AT_LINE (59)) COMMA_SOURCE_FILE_AT_LINE (59)) ;
      }
      //-------- @errorInstructionForGeneration
      GALGAS_location location_7 (object->mAttribute_mRegisterName.reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_7, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (61)) ;
    }
  }
  //-------- @assignmentInstructionForGeneration
  outArgument_outIPICregisterDescription = GALGAS_pic_31__38__5F_intermediate_5F_registerExpression::constructor_new (var_assemblyString, var_registerAddress.add_operation (object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (67)), inCompiler COMMA_SOURCE_FILE_AT_LINE (67)), var_needsBSRaccess COMMA_SOURCE_FILE_AT_LINE (65)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerExpression_resolveAccess (void) {
  enterCategoryMethod_resolveAccess (kTypeDescriptor_GALGAS_registerExpression.mSlotID,
                                     categoryMethod_registerExpression_resolveAccess) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_registerExpression_resolveAccess (void) {
  gCategoryMethodTable_registerExpression_resolveAccess.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_registerExpression_resolveAccess (defineCategoryMethod_registerExpression_resolveAccess,
                                                             freeCategoryMethod_registerExpression_resolveAccess) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@registerExpression resolveAccessWithoutCheckingBank'   *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_registerExpression_resolveAccessWithoutCheckingBank> gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_resolveAccessWithoutCheckingBank (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_registerExpression_resolveAccessWithoutCheckingBank inMethod) {
  gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_resolveAccessWithoutCheckingBank (const cPtr_registerExpression * inObject,
                                                          const GALGAS_registerTable constin_inRegisterTable,
                                                          GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication & out_outIPICregisterDescription,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) {
  out_outIPICregisterDescription.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_registerExpression) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_registerExpression_resolveAccessWithoutCheckingBank f = NULL ;
    if (classIndex < gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank.count ()) {
      f = gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank.count ()) {
           f = gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inRegisterTable, out_outIPICregisterDescription, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_registerExpression_resolveAccessWithoutCheckingBank (const cPtr_registerExpression * inObject,
                                                                                const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication & outArgument_outIPICregisterDescription,
                                                                                C_Compiler * inCompiler
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerExpression * object = inObject ;
  macroValidSharedObject (object, const cPtr_registerExpression) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_assemblyString = object->mAttribute_mRegisterName.reader_string (SOURCE_FILE_AT_LINE (79)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (80)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    var_assemblyString.dotAssign_operation (GALGAS_string (" + ").operator_concat (object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (81)).reader_hexString (SOURCE_FILE_AT_LINE (81)) COMMA_SOURCE_FILE_AT_LINE (81)) COMMA_SOURCE_FILE_AT_LINE (81)) ;
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uintlist var_registerAddressList ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_size ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_3020_0 ; // Joker input parameter
  GALGAS_string joker_3023_0 ; // Joker input parameter
  constinArgument_inRegisterTable.method_searchKey (object->mAttribute_mRegisterName, var_registerAddressList, var_size, joker_3020_0, joker_3023_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (86)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_registerAddress ;
  //-------- @methodCallInstructionForGeneration
  var_registerAddressList.method_first (var_registerAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (88)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (90)).objectCompare (var_size)).boolEnum () ;
  if (kBoolTrue == test_1) {
    //-------- @errorInstructionForGeneration
    GALGAS_location location_2 (object->mAttribute_mOffset.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_2, GALGAS_string ("this offset is too large: should be lower than ").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (91)) COMMA_SOURCE_FILE_AT_LINE (91)) COMMA_SOURCE_FILE_AT_LINE (91)) ;
  }
  //-------- @assignmentInstructionForGeneration
  outArgument_outIPICregisterDescription = GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication::constructor_new (var_assemblyString, var_registerAddress.add_operation (object->mAttribute_mOffset.reader_uint (SOURCE_FILE_AT_LINE (96)), inCompiler COMMA_SOURCE_FILE_AT_LINE (96)) COMMA_SOURCE_FILE_AT_LINE (94)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerExpression_resolveAccessWithoutCheckingBank (void) {
  enterCategoryMethod_resolveAccessWithoutCheckingBank (kTypeDescriptor_GALGAS_registerExpression.mSlotID,
                                                        categoryMethod_registerExpression_resolveAccessWithoutCheckingBank) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_registerExpression_resolveAccessWithoutCheckingBank (void) {
  gCategoryMethodTable_registerExpression_resolveAccessWithoutCheckingBank.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_registerExpression_resolveAccessWithoutCheckingBank (defineCategoryMethod_registerExpression_resolveAccessWithoutCheckingBank,
                                                                                freeCategoryMethod_registerExpression_resolveAccessWithoutCheckingBank) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Abstract category method '@pic18_intermediate_instruction display'     *
//                                                                           *
//---------------------------------------------------------------------------*

