pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_display> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_display (const PMSInt32 inClassIndex,
                                  categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_display inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_display (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_display (NULL,
                                                                               freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_display) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                 GALGAS_string & io_ioListFileContents,
                                 C_Compiler * inCompiler
                                 COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_display f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_display.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioListFileContents, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//      Category method '@pic18_intermediate_instruction isLABELorORG'       *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_isLABELorORG (const PMSInt32 inClassIndex,
                                       categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_isLABELorORG (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                      GALGAS_bool & out_outIsLABELorORG,
                                      C_Compiler * inCompiler
                                      COMMA_LOCATION_ARGS) {
  out_outIsLABELorORG.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outIsLABELorORG, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                    GALGAS_bool & outArgument_outIsLABELorORG,
                                                                                    C_Compiler * /* inCompiler */
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outIsLABELorORG = GALGAS_bool (false) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (void) {
  enterCategoryMethod_isLABELorORG (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                    categoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG.free () ;
}

//---------------------------------------------------------------------------*

