pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG,
                                                                                    freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG) ;

//---------------------------------------------------------------------------*
//                                                                           *
//         Category method '@pic18_intermediate_instruction isNULL'          *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isNULL> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_isNULL (const PMSInt32 inClassIndex,
                                 categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isNULL inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_isNULL (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                GALGAS_bool & out_outIsNULL,
                                C_Compiler * inCompiler
                                COMMA_LOCATION_ARGS) {
  out_outIsNULL.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isNULL f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outIsNULL, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                              GALGAS_bool & outArgument_outIsNULL,
                                                                              C_Compiler * /* inCompiler */
                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outIsNULL = GALGAS_bool (false) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL (void) {
  enterCategoryMethod_isNULL (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                              categoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_isNULL.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL,
                                                                              freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_isNULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category reader '@pic18_intermediate_instruction isSkippingInstruction'  *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction> gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction ;

//---------------------------------------------------------------------------*

void enterCategoryReader_isSkippingInstruction (const PMSInt32 inClassIndex,
                                                categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction inReader) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction.forceObjectAtIndex (inClassIndex, inReader, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

GALGAS_bool callCategoryReader_isSkippingInstruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) {
  GALGAS_bool result ;
//--- Find Reader
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction f = NULL ;
    if (classIndex < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction.count ()) {
      f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction.count ()) {
           f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY READER CALL ERROR", __FILE__, __LINE__) ;
    }else{
      result = f (inObject, inCompiler COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

