pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                    C_Compiler * /* inCompiler */
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsSkipping ; // Returned variable
  //-------- @assignmentInstructionForGeneration
  result_outIsSkipping = GALGAS_bool (false) ;
//---
  return result_outIsSkipping ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (void) {
  enterCategoryReader_isSkippingInstruction (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                             categoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (void) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction,
                                                                                             freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@pic18_intermediate_instruction enterReferencedLabel'   *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterReferencedLabel (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                              GALGAS_stringset & io_ioReferencedLabelSet,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioReferencedLabelSet, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                            GALGAS_stringset & /* ioArgument_ioReferencedLabelSet */,
                                                                                            C_Compiler * /* inCompiler */
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel,
                                                                                            freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_MOV_LABEL_W enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W * object = (const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (127)) ;
}
//---------------------------------------------------------------------------*

