pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_NULL display'       *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_NULL_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("-") COMMA_SOURCE_FILE_AT_LINE (142)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_NULL_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_NULL_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_NULL isNULL'        *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_NULL_isNULL (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                       GALGAS_bool & outArgument_outIsNULL,
                                                                       C_Compiler * /* inCompiler */
                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outIsNULL = GALGAS_bool (true) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_isNULL (void) {
  enterCategoryMethod_isNULL (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                              categoryMethod_pic_31__38__5F_intermediate_5F_NULL_isNULL) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_NULL_isNULL (defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_isNULL, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Overriding category method '@pic18_intermediate_pseudo_ORG display'    *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                 GALGAS_string & ioArgument_ioListFileContents,
                                                                                 C_Compiler * /* inCompiler */
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("ORG ").operator_concat (object->mAttribute_mOrigin.reader_hexString (SOURCE_FILE_AT_LINE (158)) COMMA_SOURCE_FILE_AT_LINE (158)) COMMA_SOURCE_FILE_AT_LINE (158)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_pseudo_ORG isLABELorORG'  *
//                                                                           *
//---------------------------------------------------------------------------*

