pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_isLABELorORG (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                      GALGAS_bool & outArgument_outIsLABELorORG,
                                                                                      C_Compiler * /* inCompiler */
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outIsLABELorORG = GALGAS_bool (true) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_isLABELorORG (void) {
  enterCategoryMethod_isLABELorORG (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                    categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_isLABELorORG) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_isLABELorORG (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_isLABELorORG, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@pic18_intermediate_pseudo_LABEL display'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                   GALGAS_string & ioArgument_ioListFileContents,
                                                                                   C_Compiler * /* inCompiler */
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("LABEL ").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (174)) COMMA_SOURCE_FILE_AT_LINE (174)) COMMA_SOURCE_FILE_AT_LINE (174)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_LABEL isLABELorORG' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_isLABELorORG (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                        GALGAS_bool & outArgument_outIsLABELorORG,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outIsLABELorORG = GALGAS_bool (true) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_isLABELorORG (void) {
  enterCategoryMethod_isLABELorORG (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                    categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_isLABELorORG) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_isLABELorORG (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_isLABELorORG, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_word display'       *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_word * object = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("WORD ").operator_concat (object->mAttribute_mValue.reader_hexString (SOURCE_FILE_AT_LINE (189)) COMMA_SOURCE_FILE_AT_LINE (189)) COMMA_SOURCE_FILE_AT_LINE (189)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_word_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@pic18_intermediate_MOV_LABEL_W display'    *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                     GALGAS_string & ioArgument_ioListFileContents,
                                                                                     C_Compiler * /* inCompiler */
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W * object = (const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("MOVLW ((").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (208)) COMMA_SOURCE_FILE_AT_LINE (208)).operator_concat (GALGAS_string (" + ") COMMA_SOURCE_FILE_AT_LINE (208)).operator_concat (object->mAttribute_mOffset.reader_string (SOURCE_FILE_AT_LINE (208)) COMMA_SOURCE_FILE_AT_LINE (208)).operator_concat (GALGAS_string (") >> ") COMMA_SOURCE_FILE_AT_LINE (208)).operator_concat (object->mAttribute_mRightShift.reader_string (SOURCE_FILE_AT_LINE (208)) COMMA_SOURCE_FILE_AT_LINE (208)).operator_concat (GALGAS_string (") & 0xFF") COMMA_SOURCE_FILE_AT_LINE (208)) COMMA_SOURCE_FILE_AT_LINE (208)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FDA getBaseCode'     *
//                                                                           *
//---------------------------------------------------------------------------*

