pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  out_outBaseCode.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outBaseCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inObject,
                                                                                          GALGAS_uint & outArgument_outBaseCode,
                                                                                          C_Compiler * /* inCompiler */
                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mInstruction_5F_FDA_5F_base_5F_code.isValid ()) {
    switch (object->mAttribute_mInstruction_5F_FDA_5F_base_5F_code.enumValue ()) {
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kNotBuilt:
      break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_ADDWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 9216U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_ADDWFC: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 8192U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_ANDWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 5120U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_COMF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 7168U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_DECF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 1024U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_DECFSZ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 11264U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_DCFSNZ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 19456U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_INCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 10240U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_INCFSZ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 15360U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_INFSNZ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 18432U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_IORWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 4096U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_MOVF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 20480U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_RLCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 13312U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_RLNCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 17408U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_RRCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 12288U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_RRNCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 16384U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_SUBFWB: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 21504U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_SUBWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 23552U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_SUBWFB: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 22528U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_SWAPF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 14336U) ;
      } break ;
    case GALGAS_instruction_5F_FDA_5F_base_5F_code::kEnum_XORWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 6144U) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (void) {
  enterCategoryMethod_getBaseCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode,
                                                                                          freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_FDA display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                      C_Compiler * inCompiler
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_mnemonic (object->mAttribute_mInstruction_5F_FDA_5F_base_5F_code, inCompiler COMMA_SOURCE_FILE_AT_LINE (249)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (249)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (249)) COMMA_SOURCE_FILE_AT_LINE (249)) COMMA_SOURCE_FILE_AT_LINE (249)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", W") COMMA_SOURCE_FILE_AT_LINE (251)) ;
  }
}
//---------------------------------------------------------------------------*

