pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FA getBaseCode'      *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  out_outBaseCode.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outBaseCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * inObject,
                                                                                         GALGAS_uint & outArgument_outBaseCode,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mFAinstruction.isValid ()) {
    switch (object->mAttribute_mFAinstruction.enumValue ()) {
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kNotBuilt:
      break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CLRF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 27136U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSEQ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 25088U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSGT: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 25600U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSLT: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 24576U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_MOVWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 28160U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_MULWF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 512U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_NEGF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 27648U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_SETF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 26624U) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_TSTFSZ: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 26112U) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (void) {
  enterCategoryMethod_getBaseCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode) ;
}

//---------------------------------------------------------------------------*

