pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode,
                                                                                         freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18_intermediate_instruction_FA display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                     GALGAS_string & ioArgument_ioListFileContents,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_mnemonic (object->mAttribute_mFAinstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (278)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (278)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (278)) COMMA_SOURCE_FILE_AT_LINE (278)) COMMA_SOURCE_FILE_AT_LINE (278)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FA_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_FA isSkippingInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_FA_isSkippingInstruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                          C_Compiler * /* inCompiler */
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsSkipping ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mFAinstruction.isValid ()) {
    switch (object->mAttribute_mFAinstruction.enumValue ()) {
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kNotBuilt:
      break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CLRF: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (false) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSEQ: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (true) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSGT: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (true) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_CPFSLT: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (true) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_MOVWF: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (false) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_MULWF: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (false) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_NEGF: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (false) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_SETF: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (false) ;
      } break ;
    case GALGAS_FA_5F_instruction_5F_base_5F_code::kEnum_TSTFSZ: {
      //-------- @assignmentInstructionForGeneration
      result_outIsSkipping = GALGAS_bool (true) ;
      } break ;
    }
  }
//---
  return result_outIsSkipping ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_FA_isSkippingInstruction (void) {
  enterCategoryReader_isSkippingInstruction (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA.mSlotID,
                                             categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_FA_isSkippingInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_FA_isSkippingInstruction (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_FA_isSkippingInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVFF display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("MOVFF ").operator_concat (object->mAttribute_mSourceRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (306)) COMMA_SOURCE_FILE_AT_LINE (306)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (306)).operator_concat (object->mAttribute_mDestinationRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (306)) COMMA_SOURCE_FILE_AT_LINE (306)) COMMA_SOURCE_FILE_AT_LINE (306)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_display) ;
}

//---------------------------------------------------------------------------*

