pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FBA getBaseCode'     *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  out_outBaseCode.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outBaseCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * inObject,
                                                                                          GALGAS_uint & outArgument_outBaseCode,
                                                                                          C_Compiler * /* inCompiler */
                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mBitOrientedOp.isValid ()) {
    switch (object->mAttribute_mBitOrientedOp.enumValue ()) {
    case GALGAS_bit_5F_oriented_5F_op::kNotBuilt:
      break ;
    case GALGAS_bit_5F_oriented_5F_op::kEnum_BCF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 36864U) ;
      } break ;
    case GALGAS_bit_5F_oriented_5F_op::kEnum_BSF: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 32768U) ;
      } break ;
    case GALGAS_bit_5F_oriented_5F_op::kEnum_BTG: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 28672U) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (void) {
  enterCategoryMethod_getBaseCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode,
                                                                                          freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_FBA display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                      C_Compiler * inCompiler
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_mnemonic (object->mAttribute_mBitOrientedOp, inCompiler COMMA_SOURCE_FILE_AT_LINE (327)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (327)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (327)) COMMA_SOURCE_FILE_AT_LINE (327)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (327)).operator_concat (object->mAttribute_mBitNumber.reader_string (SOURCE_FILE_AT_LINE (327)) COMMA_SOURCE_FILE_AT_LINE (327)) COMMA_SOURCE_FILE_AT_LINE (327)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Category method '@pic18_intermediate_instruction_BitTestSkip getBaseCode' *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  out_outBaseCode.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outBaseCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                                                                                  GALGAS_uint & outArgument_outBaseCode,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mSkipIfSet.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @assignmentInstructionForGeneration
    outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 40960U) ;
  }else if (kBoolFalse == test_0) {
    //-------- @assignmentInstructionForGeneration
    outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 45056U) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (void) {
  enterCategoryMethod_getBaseCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode,
                                                                                                  freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_BitTestSkip display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                              GALGAS_string & ioArgument_ioListFileContents,
                                                                                              C_Compiler * /* inCompiler */
                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mSkipIfSet.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("BTFSS") COMMA_SOURCE_FILE_AT_LINE (351)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("BTFSC") COMMA_SOURCE_FILE_AT_LINE (353)) ;
  }
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (355)) COMMA_SOURCE_FILE_AT_LINE (355)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (355)).operator_concat (object->mAttribute_mBitNumber.reader_string (SOURCE_FILE_AT_LINE (355)) COMMA_SOURCE_FILE_AT_LINE (355)) COMMA_SOURCE_FILE_AT_LINE (355)) ;
}
//---------------------------------------------------------------------------*

