pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_BitTestSkip isSkippingInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_bool categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_isSkippingInstruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                   C_Compiler * /* inCompiler */
                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_bool result_outIsSkipping ; // Returned variable
  //-------- @assignmentInstructionForGeneration
  result_outIsSkipping = GALGAS_bool (true) ;
//---
  return result_outIsSkipping ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_isSkippingInstruction (void) {
  enterCategoryReader_isSkippingInstruction (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                             categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_isSkippingInstruction) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_isSkippingInstruction (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_isSkippingInstruction, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//              Category Reader '@conditional_branch condition'              *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_string categoryReader_condition (const GALGAS_conditional_5F_branch & inObject,
                                        C_Compiler * /* inCompiler */
                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_string result_outResult ; // Returned variable
  //------- @switchInstructionForGeneration
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_conditional_5F_branch temp_0 = inObject ;
  if (temp_0.isValid ()) {
    switch (temp_0.enumValue ()) {
    case GALGAS_conditional_5F_branch::kNotBuilt:
      break ;
    case GALGAS_conditional_5F_branch::kEnum_bz: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("Z") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnz: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("NZ") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bn: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("N") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnn: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("NN") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bc: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("C") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnc: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("NC") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bov: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("OV") ;
      } break ;
    case GALGAS_conditional_5F_branch::kEnum_bnov: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("NOV") ;
      } break ;
    }
  }
//---
  return result_outResult ;
}




//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                    GALGAS_string & ioArgument_ioListFileContents,
                                                                                                    C_Compiler * inCompiler
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ").operator_concat (categoryReader_condition (object->mAttribute_mConditionalBranch, inCompiler COMMA_SOURCE_FILE_AT_LINE (394)) COMMA_SOURCE_FILE_AT_LINE (394)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (394)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (394)) COMMA_SOURCE_FILE_AT_LINE (394)) COMMA_SOURCE_FILE_AT_LINE (394)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                 GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                                 C_Compiler * /* inCompiler */
                                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (398)) COMMA_SOURCE_FILE_AT_LINE (398)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_JUMP display'       *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (412)) COMMA_SOURCE_FILE_AT_LINE (412)) COMMA_SOURCE_FILE_AT_LINE (412)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (413)) COMMA_SOURCE_FILE_AT_LINE (413)) COMMA_SOURCE_FILE_AT_LINE (413)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("BRA ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (414)) COMMA_SOURCE_FILE_AT_LINE (414)) COMMA_SOURCE_FILE_AT_LINE (414)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("GOTO ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (415)) COMMA_SOURCE_FILE_AT_LINE (415)) COMMA_SOURCE_FILE_AT_LINE (415)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_JUMP enterReferencedLabel' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                     GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                     C_Compiler * /* inCompiler */
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (420)) COMMA_SOURCE_FILE_AT_LINE (420)) ;
}
//---------------------------------------------------------------------------*

