pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18_intermediate_JSR display'        *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                       C_Compiler * /* inCompiler */
                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JSR ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (433)) COMMA_SOURCE_FILE_AT_LINE (433)) COMMA_SOURCE_FILE_AT_LINE (433)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JSR ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (434)) COMMA_SOURCE_FILE_AT_LINE (434)) COMMA_SOURCE_FILE_AT_LINE (434)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RCALL ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (435)) COMMA_SOURCE_FILE_AT_LINE (435)) COMMA_SOURCE_FILE_AT_LINE (435)) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("CALL ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (436)) COMMA_SOURCE_FILE_AT_LINE (436)) COMMA_SOURCE_FILE_AT_LINE (436)) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_JSR_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_JSR enterReferencedLabel' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                    GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                    C_Compiler * /* inCompiler */
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (441)) COMMA_SOURCE_FILE_AT_LINE (441)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_JSR_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_CLRWDT display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("CLRWDT") COMMA_SOURCE_FILE_AT_LINE (452)) ;
}
//---------------------------------------------------------------------------*

