pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_CLRWDT_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_DAW display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                      C_Compiler * /* inCompiler */
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("DAW") COMMA_SOURCE_FILE_AT_LINE (462)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_DAW.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_DAW_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_NOP display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                      C_Compiler * /* inCompiler */
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("NOP") COMMA_SOURCE_FILE_AT_LINE (472)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_NOP.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_NOP_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_POP display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                                      C_Compiler * /* inCompiler */
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("POP") COMMA_SOURCE_FILE_AT_LINE (483)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_POP.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_POP_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_PUSH display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                                       C_Compiler * /* inCompiler */
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("PUSH") COMMA_SOURCE_FILE_AT_LINE (493)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_PUSH_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RESET display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RESET") COMMA_SOURCE_FILE_AT_LINE (503)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RESET.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RESET_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETURN") COMMA_SOURCE_FILE_AT_LINE (513)) ;
}
//---------------------------------------------------------------------------*

