pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                               GALGAS_string & ioArgument_ioListFileContents,
                                                                                                               C_Compiler * /* inCompiler */
                                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETURN NOT OPTIMIZABLE") COMMA_SOURCE_FILE_AT_LINE (523)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETFIE display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETFIE") COMMA_SOURCE_FILE_AT_LINE (534)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mFastReturn.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" FAST") COMMA_SOURCE_FILE_AT_LINE (536)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_SLEEP display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("SLEEP") COMMA_SOURCE_FILE_AT_LINE (546)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_display) ;
}

//---------------------------------------------------------------------------*

