pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_SLEEP_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_literalOperation getBaseCode'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  out_outBaseCode.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outBaseCode, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                                                                                       GALGAS_uint & outArgument_outBaseCode,
                                                                                                       C_Compiler * /* inCompiler */
                                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mLiteralInstruction.isValid ()) {
    switch (object->mAttribute_mLiteralInstruction.enumValue ()) {
    case GALGAS_literal_5F_instruction_5F_opcode::kNotBuilt:
      break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_ADDLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 3840U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_ANDLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 2816U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_IORLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 2304U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_MOVLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 3584U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_MULLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 3328U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_SUBLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 2048U) ;
      } break ;
    case GALGAS_literal_5F_instruction_5F_opcode::kEnum_XORLW: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outBaseCode = GALGAS_uint ((PMUInt32) 2560U) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (void) {
  enterCategoryMethod_getBaseCode (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode.free () ;
}

//---------------------------------------------------------------------------*

