pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode,
                                                                                                       freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_literalOperation display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                   GALGAS_string & ioArgument_ioListFileContents,
                                                                                                   C_Compiler * inCompiler
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_mnemonic (object->mAttribute_mLiteralInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (571)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (571)).operator_concat (object->mAttribute_mLiteralValue.reader_hexString (SOURCE_FILE_AT_LINE (571)) COMMA_SOURCE_FILE_AT_LINE (571)) COMMA_SOURCE_FILE_AT_LINE (571)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_RETLW display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETLW ").operator_concat (object->mAttribute_mLiteralValue.reader_hexString (SOURCE_FILE_AT_LINE (582)) COMMA_SOURCE_FILE_AT_LINE (582)) COMMA_SOURCE_FILE_AT_LINE (582)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_LFSR display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                                       C_Compiler * /* inCompiler */
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("LFSR ").operator_concat (object->mAttribute_mFSRindex.reader_uint (SOURCE_FILE_AT_LINE (594)).reader_string (SOURCE_FILE_AT_LINE (594)) COMMA_SOURCE_FILE_AT_LINE (594)).operator_concat (GALGAS_string (", ") COMMA_SOURCE_FILE_AT_LINE (594)).operator_concat (object->mAttribute_mValue.reader_hexString (SOURCE_FILE_AT_LINE (594)) COMMA_SOURCE_FILE_AT_LINE (594)) COMMA_SOURCE_FILE_AT_LINE (594)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_display) ;
}

//---------------------------------------------------------------------------*

