pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_MOVLB display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("MOVLB ").operator_concat (object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (606)).reader_string (SOURCE_FILE_AT_LINE (606)) COMMA_SOURCE_FILE_AT_LINE (606)) COMMA_SOURCE_FILE_AT_LINE (606)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLRD display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("TBLRD ").operator_concat (categoryReader_mnemonic (object->mAttribute_mOption, inCompiler COMMA_SOURCE_FILE_AT_LINE (618)) COMMA_SOURCE_FILE_AT_LINE (618)) COMMA_SOURCE_FILE_AT_LINE (618)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_TBLWT display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("TBLWT ").operator_concat (categoryReader_mnemonic (object->mAttribute_mOption, inCompiler COMMA_SOURCE_FILE_AT_LINE (629)) COMMA_SOURCE_FILE_AT_LINE (629)) COMMA_SOURCE_FILE_AT_LINE (629)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_instruction_MNOP display' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                                       C_Compiler * /* inCompiler */
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("MNOP ").operator_concat (object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (640)).reader_string (SOURCE_FILE_AT_LINE (640)) COMMA_SOURCE_FILE_AT_LINE (640)) COMMA_SOURCE_FILE_AT_LINE (640)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                    GALGAS_string & ioArgument_ioListFileContents,
                                                                                                    C_Compiler * /* inCompiler */
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED RETLW ") COMMA_SOURCE_FILE_AT_LINE (652)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (654)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (656)) ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_uintlist enumerator_22062 (object->mAttribute_mLiteralValues, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_22062.hasCurrentObject ()) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", ").operator_concat (enumerator_22062.current_mValue (HERE).reader_hexString (SOURCE_FILE_AT_LINE (659)) COMMA_SOURCE_FILE_AT_LINE (659)) COMMA_SOURCE_FILE_AT_LINE (659)) ;
    enumerator_22062.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                                 GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                                 C_Compiler * /* inCompiler */
                                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (GALGAS_string ("_computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (664)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

