pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                  GALGAS_string & ioArgument_ioListFileContents,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED BRA ") COMMA_SOURCE_FILE_AT_LINE (676)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (678)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (680)) ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_22857 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_22857.hasCurrentObject ()) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", ").operator_concat (enumerator_22857.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (683)) COMMA_SOURCE_FILE_AT_LINE (683)) COMMA_SOURCE_FILE_AT_LINE (683)) ;
    enumerator_22857.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                               GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                               C_Compiler * /* inCompiler */
                                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (GALGAS_string ("_computed_goto_2") COMMA_SOURCE_FILE_AT_LINE (688)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_23122 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_23122.hasCurrentObject ()) {
    //-------- @plusEqualnstructionForGeneration
    ioArgument_ioReferencedLabelSet.addAssign_operation (enumerator_23122.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (690)) COMMA_SOURCE_FILE_AT_LINE (690)) ;
    enumerator_23122.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                   GALGAS_string & ioArgument_ioListFileContents,
                                                                                                   C_Compiler * /* inCompiler */
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED GOTO ") COMMA_SOURCE_FILE_AT_LINE (703)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (705)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (707)) ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_23731 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_23731.hasCurrentObject ()) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", ").operator_concat (enumerator_23731.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (710)) COMMA_SOURCE_FILE_AT_LINE (710)) COMMA_SOURCE_FILE_AT_LINE (710)) ;
    enumerator_23731.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_display) ;
}

//---------------------------------------------------------------------------*

