pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                                C_Compiler * /* inCompiler */
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (GALGAS_string ("_computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (715)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_23997 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_23997.hasCurrentObject ()) {
    //-------- @plusEqualnstructionForGeneration
    ioArgument_ioReferencedLabelSet.addAssign_operation (enumerator_23997.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (717)) COMMA_SOURCE_FILE_AT_LINE (717)) ;
    enumerator_23997.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                    GALGAS_string & ioArgument_ioListFileContents,
                                                                                                    C_Compiler * /* inCompiler */
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED RCALL ") COMMA_SOURCE_FILE_AT_LINE (731)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("(uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (733)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("(uses CALL)") COMMA_SOURCE_FILE_AT_LINE (735)) ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_24642 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_24642.hasCurrentObject ()) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", ").operator_concat (enumerator_24642.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (738)) COMMA_SOURCE_FILE_AT_LINE (738)) COMMA_SOURCE_FILE_AT_LINE (738)) ;
    enumerator_24642.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                 GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                                 C_Compiler * /* inCompiler */
                                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (GALGAS_string ("_computed_goto_4") COMMA_SOURCE_FILE_AT_LINE (743)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_24909 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  //--- simple foreach instruction
  while (enumerator_24909.hasCurrentObject ()) {
    //-------- @plusEqualnstructionForGeneration
    ioArgument_ioReferencedLabelSet.addAssign_operation (enumerator_24909.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (745)) COMMA_SOURCE_FILE_AT_LINE (745)) ;
    enumerator_24909.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

