pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                            GALGAS_string & ioArgument_ioListFileContents,
                                                                                            C_Compiler * /* inCompiler */
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * object = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ").operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (760)) COMMA_SOURCE_FILE_AT_LINE (760)) COMMA_SOURCE_FILE_AT_LINE (760)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mBranchIfZero.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" Z") COMMA_SOURCE_FILE_AT_LINE (762)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" NZ") COMMA_SOURCE_FILE_AT_LINE (764)) ;
  }
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (766)) COMMA_SOURCE_FILE_AT_LINE (766)) COMMA_SOURCE_FILE_AT_LINE (766)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_jump_test_register enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                         C_Compiler * /* inCompiler */
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * object = (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (770)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                             GALGAS_string & ioArgument_ioListFileContents,
                                                                                             C_Compiler * /* inCompiler */
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ") COMMA_SOURCE_FILE_AT_LINE (787)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mIncrement.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("INCF ") COMMA_SOURCE_FILE_AT_LINE (789)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("DECF ") COMMA_SOURCE_FILE_AT_LINE (791)) ;
  }
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (793)) COMMA_SOURCE_FILE_AT_LINE (793)) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_1 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
  if (kBoolTrue == test_1) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", W ") COMMA_SOURCE_FILE_AT_LINE (795)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_2 = object->mAttribute_mBranchIfZero.boolEnum () ;
  if (kBoolTrue == test_2) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Z") COMMA_SOURCE_FILE_AT_LINE (798)) ;
  }else if (kBoolFalse == test_2) {
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("NZ") COMMA_SOURCE_FILE_AT_LINE (800)) ;
  }
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (802)) COMMA_SOURCE_FILE_AT_LINE (802)) COMMA_SOURCE_FILE_AT_LINE (802)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_display) ;
}

//---------------------------------------------------------------------------*

