pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                          GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                          C_Compiler * /* inCompiler */
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (806)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_registerComparisonCondition usesIntermediateBRA'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_usesIntermediateBRA (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_usesIntermediateBRA (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                             GALGAS_bool & out_outUses,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) {
  out_outUses.drop () ;
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, out_outUses, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                                                                                           GALGAS_bool & outArgument_outUses,
                                                                                                           C_Compiler * /* inCompiler */
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mComparison.isValid ()) {
    switch (object->mAttribute_mComparison.enumValue ()) {
    case GALGAS_registerComparison::kNotBuilt:
      break ;
    case GALGAS_registerComparison::kEnum_notEqual: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (false) ;
      } break ;
    case GALGAS_registerComparison::kEnum_equal: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (true) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greaterOrEqual: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (false) ;
      } break ;
    case GALGAS_registerComparison::kEnum_greater: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (true) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lowerOrEqual: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (false) ;
      } break ;
    case GALGAS_registerComparison::kEnum_lower: {
      //-------- @assignmentInstructionForGeneration
      outArgument_outUses = GALGAS_bool (true) ;
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

