pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (void) {
  enterCategoryMethod_usesIntermediateBRA (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA,
                                                                                                           freeCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA) ;

//---------------------------------------------------------------------------*
//                                                                           *
//              Category Reader '@registerComparison mnemonic'               *
//                                                                           *
//---------------------------------------------------------------------------*

GALGAS_string categoryReader_mnemonic (const GALGAS_registerComparison & inObject,
                                       C_Compiler * /* inCompiler */
                                       COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_string result_outResult ; // Returned variable
  //------- @switchInstructionForGeneration
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_registerComparison temp_0 = inObject ;
  if (temp_0.isValid ()) {
    switch (temp_0.enumValue ()) {
    case GALGAS_registerComparison::kNotBuilt:
      break ;
    case GALGAS_registerComparison::kEnum_notEqual: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("!=") ;
      } break ;
    case GALGAS_registerComparison::kEnum_equal: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("==") ;
      } break ;
    case GALGAS_registerComparison::kEnum_greaterOrEqual: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string (">=") ;
      } break ;
    case GALGAS_registerComparison::kEnum_greater: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string (">") ;
      } break ;
    case GALGAS_registerComparison::kEnum_lowerOrEqual: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("<=") ;
      } break ;
    case GALGAS_registerComparison::kEnum_lower: {
      //-------- @assignmentInstructionForGeneration
      result_outResult = GALGAS_string ("<") ;
      } break ;
    }
  }
//---
  return result_outResult ;
}




//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition display'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                               GALGAS_string & ioArgument_ioListFileContents,
                                                                                               C_Compiler * inCompiler
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ") COMMA_SOURCE_FILE_AT_LINE (842)) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (843)) COMMA_SOURCE_FILE_AT_LINE (843)) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (categoryReader_mnemonic (object->mAttribute_mComparison, inCompiler COMMA_SOURCE_FILE_AT_LINE (844)) COMMA_SOURCE_FILE_AT_LINE (844)) COMMA_SOURCE_FILE_AT_LINE (844)) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (845)) COMMA_SOURCE_FILE_AT_LINE (845)) COMMA_SOURCE_FILE_AT_LINE (845)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                               categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_display (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition enterReferencedLabel'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                            GALGAS_stringset & ioArgument_ioReferencedLabelSet,
                                                                                                            C_Compiler * /* inCompiler */
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  //-------- @plusEqualnstructionForGeneration
  ioArgument_ioReferencedLabelSet.addAssign_operation (object->mAttribute_mTargetLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (849)) ;
}
//---------------------------------------------------------------------------*

