pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_enterReferencedLabel (void) {
  enterCategoryMethod_enterReferencedLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_enterReferencedLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_enterReferencedLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_enterReferencedLabel, NULL) ;

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (void) :
mAttribute_mInstruction () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::~ GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0) :
mAttribute_mInstruction (inOperand0) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::constructor_new (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0 
                                                                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element result ;
  if (inOperand0.isValid ()) {
    result = GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (inOperand0) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_mInstruction.objectCompare (inOperand.mAttribute_mInstruction) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::isValid (void) const {
  return mAttribute_mInstruction.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::drop (void) {
  mAttribute_mInstruction.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::description (C_String & ioString,
                                                                                    const PMSInt32 inIndentation) const {
  ioString << "<struct @pic18_intermediate_instructionList.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_mInstruction.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instruction GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::reader_mInstruction (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mInstruction ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//             @pic18_intermediate_instructionList.element type              *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element ("pic18_intermediate_instructionList.element",
                                                                                  NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                                                                                  C_Compiler * inCompiler,
                                                                                                                                                  const GALGAS_location & inErrorLocation
                                                                                                                                                  COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element * p = (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->extractObjectError (inErrorLocation, "pic18_intermediate_instructionList.element", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


